In [58]:
#Dependencies

import requests
import json
from matplotlib import pyplot as plt
from scipy.stats import linregress
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [62]:
# The path to our CSV file
file_gdp = "out.csv"

# Read Suicide Data our Kickstarter data into pandas
df = pd.read_csv(file_gdp)
df.head()

,Unnamed: 0,country,year,sex,age,suicides_no,population,suicides/100k pop,country-year,HDI for year,gdp_for_year,gdp_per_capita ($),generation
0,0,Albania,1987,male,15-24 years,21,312900,6.71,Albania1987,NaN,"2,156,624,900",796,Generation X
1,1,Albania,1987,male,35-54 years,16,308000,5.19,Albania1987,NaN,"2,156,624,900",796,Silent
2,2,Albania,1987,female,15-24 years,14,289700,4.83,Albania1987,NaN,"2,156,624,900",796,Generation X
3,3,Albania,1987,male,75+ years,1,21800,4.59,Albania1987,NaN,"2,156,624,900",796,G.I. Generation
4,4,Albania,1987,male,25-34 years,9,274300,3.28,Albania1987,NaN,"2,156,624,900",796,Boomers

In [67]:
df.columns

Index(['Unnamed: 0', 'country', 'year', 'sex', 'age', 'suicides_no',
       'population', 'suicides/100k pop', 'country-year', 'HDI for year',
       ' gdp_for_year', 'gdp_per_capita ($)', 'generation'],
      dtype='object')

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27820 entries, 0 to 27819
Data columns (total 12 columns):
country               27820 non-null object
year                  27820 non-null int64
sex                   27820 non-null object
age                   27820 non-null object
suicides_no           27820 non-null int64
population            27820 non-null int64
suicides/100k pop     27820 non-null float64
country-year          27820 non-null object
HDI for year          8364 non-null float64
 gdp_for_year ($)     27820 non-null object
gdp_per_capita ($)    27820 non-null int64
generation            27820 non-null object
dtypes: float64(2), int64(4), object(6)
memory usage: 2.5+ MB

In [68]:
df = df.groupby('country-year').agg({' gdp_for_year':'first', 'population':'sum'}).reset_index()
print (df)

                 country-year    gdp_for_year  population
0                 Albania1987   2,156,624,900     2709600
1                 Albania1988   2,126,000,000     2764300
2                 Albania1989   2,335,124,988     2803100
3                 Albania1992     709,452,584     2822500
4                 Albania1993   1,228,071,038     2807300
5                 Albania1994   1,985,673,798     2849300
6                 Albania1995   2,424,499,009     2903400
7                 Albania1996   3,314,898,292     2940200
8                 Albania1997   2,359,903,108     2977300
9                 Albania1998   2,707,123,772     3012700
10                Albania1999   3,414,760,915     3029700
11                Albania2000   3,632,043,908     2796300
12                Albania2001   4,060,758,804     2799349
13                Albania2002   4,435,078,648     2818839
14                Albania2003   5,746,945,913     2843929
15                Albania2004   7,314,865,176     2874991
16                Albania2005   8,158,548,717     2783320
17                Albania2006   8,992,642,349     2780176
18                Albania2007  10,701,011,897     2770344
19                Albania2008  12,881,352,688     2757059
20                Albania2009  12,044,212,904     2745735
21                Albania2010  11,926,953,259     2736025
22    Antigua and Barbuda1985     240,923,926       62574
23    Antigua and Barbuda1986     290,440,148       61270
24    Antigua and Barbuda1987     337,174,852       60261
25    Antigua and Barbuda1988     398,637,741       59564
26    Antigua and Barbuda1989     438,794,778       59238
27    Antigua and Barbuda1990     459,469,074       59334
28    Antigua and Barbuda1991     481,706,333       60394
29    Antigua and Barbuda1992     499,281,148       61741
...                       ...             ...         ...
2291              Uruguay2007  23,410,572,634     3087957
2292              Uruguay2008  30,366,213,119     3100791
2293              Uruguay2009  31,660,911,277     3114306
2294              Uruguay2010  40,284,481,652     3127306
2295              Uruguay2012  51,264,390,116     3151939
2296              Uruguay2013  57,531,233,351     3164670
2297              Uruguay2014  57,236,013,086     3177645
2298              Uruguay2015  53,274,304,222     3190795
2299           Uzbekistan1990  13,360,607,918    17165700
2300           Uzbekistan1991  13,677,622,222    17347800
2301           Uzbekistan1992  12,941,297,376    18257000
2302           Uzbekistan1993  13,099,013,836    18509300
2303           Uzbekistan1994  12,899,156,991    19144700
2304           Uzbekistan1995  13,350,468,917    19599000
2305           Uzbekistan1996  13,948,892,216    19854500
2306           Uzbekistan1997  14,744,603,774    20364300
2307           Uzbekistan1998  14,988,971,211    20861200
2308           Uzbekistan1999  17,078,465,982    21329916
2309           Uzbekistan2000  13,760,374,488    21789067
2310           Uzbekistan2001  11,401,351,420    22231527
2311           Uzbekistan2002   9,687,951,055    22632256
2312           Uzbekistan2003  10,128,112,401    22982883
2313           Uzbekistan2004  12,030,023,548    23300841
2314           Uzbekistan2005  14,307,509,839    23600347
2315           Uzbekistan2009  33,689,223,673    25288102
2316           Uzbekistan2010  39,332,770,929    25651783
2317           Uzbekistan2011  45,915,191,189    25978049
2318           Uzbekistan2012  51,821,573,338    26381830
2319           Uzbekistan2013  57,690,453,461    26838924
2320           Uzbekistan2014  63,067,077,179    27313507

[2321 rows x 3 columns]

<class 'pandas.core.frame.DataFrame'>
Int64Index: 96 entries, 193 to 9450
Data columns (total 39 columns):
Country       96 non-null int64
Admin1        0 non-null float64
SubDiv        0 non-null float64
Year          96 non-null int64
List          96 non-null object
Cause         96 non-null object
Sex           96 non-null int64
Frmat         96 non-null int64
IM_Frmat      96 non-null int64
Deaths1       96 non-null int64
Deaths2       96 non-null float64
Deaths3       96 non-null float64
Deaths4       50 non-null float64
Deaths5       50 non-null float64
Deaths6       50 non-null float64
Deaths7       96 non-null float64
Deaths8       88 non-null float64
Deaths9       96 non-null float64
Deaths10      88 non-null float64
Deaths11      96 non-null float64
Deaths12      88 non-null float64
Deaths13      96 non-null float64
Deaths14      88 non-null float64
Deaths15      96 non-null float64
Deaths16      88 non-null float64
Deaths17      96 non-null float64
Deaths18      88 non-null float64
Deaths19      96 non-null float64
Deaths20      88 non-null float64
Deaths21      96 non-null float64
Deaths22      84 non-null float64
Deaths23      84 non-null float64
Deaths24      0 non-null float64
Deaths25      0 non-null float64
Deaths26      96 non-null float64
IM_Deaths1    96 non-null float64
IM_Deaths2    10 non-null float64
IM_Deaths3    18 non-null float64
IM_Deaths4    18 non-null float64
dtypes: float64(31), int64(6), object(2)
memory usage: 30.0+ KB

In [17]:
# The path to our CSV file
file_gdp2 = "Morticd10_part2.csv"

# Read Suicide Data our Kickstarter data into pandas
df2 = pd.read_csv(file_gdp2)
df2.head()

,Country,Admin1,SubDiv,Year,List,Cause,Sex,Frmat,IM_Frmat,Deaths1,...,Deaths21,Deaths22,Deaths23,Deaths24,Deaths25,Deaths26,IM_Deaths1,IM_Deaths2,IM_Deaths3,IM_Deaths4
0,1400,NaN,NaN,2005,101,1000,1,7,8,386,...,136.0,NaN,NaN,NaN,NaN,0.0,10.0,NaN,NaN,NaN
1,1400,NaN,NaN,2005,101,1000,2,7,8,287,...,163.0,NaN,NaN,NaN,NaN,0.0,6.0,NaN,NaN,NaN
2,1400,NaN,NaN,2005,101,1001,1,7,8,29,...,13.0,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN
3,1400,NaN,NaN,2005,101,1001,2,7,8,21,...,16.0,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN
4,1400,NaN,NaN,2005,101,1002,1,7,8,0,...,0.0,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN

In [40]:
cause_list_csv = "cause_list.csv"

# Read Suicide Data our Kickstarter data into pandas
causes = pd.read_csv(cause_list_csv)
causes.head()

  Cause
0  1101
1   X60
2   X61
3   X62
4   X63

In [36]:
organized_crime_data_2017_df["Level of Crime"] = 
np.where(organized_crime_data_2017_df["crime"].isin(Cause), "Minor", "Major")

df22 = df2[df2['Cause'] == ""]
df22.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 156 entries, 193 to 15465
Data columns (total 39 columns):
Country       156 non-null int64
Admin1        0 non-null float64
SubDiv        0 non-null object
Year          156 non-null int64
List          156 non-null object
Cause         156 non-null object
Sex           156 non-null int64
Frmat         156 non-null int64
IM_Frmat      156 non-null int64
Deaths1       156 non-null int64
Deaths2       136 non-null float64
Deaths3       136 non-null float64
Deaths4       74 non-null float64
Deaths5       74 non-null float64
Deaths6       74 non-null float64
Deaths7       136 non-null float64
Deaths8       114 non-null float64
Deaths9       136 non-null float64
Deaths10      114 non-null float64
Deaths11      136 non-null float64
Deaths12      114 non-null float64
Deaths13      136 non-null float64
Deaths14      114 non-null float64
Deaths15      136 non-null float64
Deaths16      114 non-null float64
Deaths17      136 non-null float64
Deaths18      114 non-null float64
Deaths19      136 non-null float64
Deaths20      114 non-null float64
Deaths21      136 non-null float64
Deaths22      114 non-null float64
Deaths23      114 non-null float64
Deaths24      6 non-null float64
Deaths25      6 non-null float64
Deaths26      136 non-null float64
IM_Deaths1    136 non-null float64
IM_Deaths2    16 non-null float64
IM_Deaths3    28 non-null float64
IM_Deaths4    28 non-null float64
dtypes: float64(30), int64(6), object(3)
memory usage: 48.8+ KB

In [19]:
frames = [df1, df22]
result = pd.concat(frames)

In [30]:
result.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 252 entries, 193 to 15465
Data columns (total 39 columns):
Country       252 non-null int64
Admin1        0 non-null float64
SubDiv        0 non-null object
Year          252 non-null int64
List          252 non-null object
Cause         252 non-null object
Sex           252 non-null int64
Frmat         252 non-null int64
IM_Frmat      252 non-null int64
Deaths1       252 non-null int64
Deaths2       232 non-null float64
Deaths3       232 non-null float64
Deaths4       124 non-null float64
Deaths5       124 non-null float64
Deaths6       124 non-null float64
Deaths7       232 non-null float64
Deaths8       202 non-null float64
Deaths9       232 non-null float64
Deaths10      202 non-null float64
Deaths11      232 non-null float64
Deaths12      202 non-null float64
Deaths13      232 non-null float64
Deaths14      202 non-null float64
Deaths15      232 non-null float64
Deaths16      202 non-null float64
Deaths17      232 non-null float64
Deaths18      202 non-null float64
Deaths19      232 non-null float64
Deaths20      202 non-null float64
Deaths21      232 non-null float64
Deaths22      198 non-null float64
Deaths23      198 non-null float64
Deaths24      6 non-null float64
Deaths25      6 non-null float64
Deaths26      232 non-null float64
IM_Deaths1    232 non-null float64
IM_Deaths2    26 non-null float64
IM_Deaths3    46 non-null float64
IM_Deaths4    46 non-null float64
dtypes: float64(30), int64(6), object(3)
memory usage: 78.8+ KB

In [27]:
suicide_data = result[["Country", "Year", "Cause", "Sex", "Deaths1"]]
suicide_data.describe()

           Country         Year         Sex       Deaths1
count   252.000000   252.000000  252.000000    252.000000
mean   3582.515873  2006.428571    1.500000   3371.222222
std     925.944563     4.985123    0.500995   8897.217523
min    1400.000000  1996.000000    1.000000      0.000000
25%    3080.000000  2002.000000    1.000000      4.000000
50%    4018.000000  2007.000000    1.500000     79.000000
75%    4275.000000  2011.000000    2.000000   1769.250000
max    4303.000000  2015.000000    2.000000  48251.000000

In [28]:
df.count()

Country       1388106
Admin1          84173
SubDiv              0
Year          1388106
List          1388106
Cause         1388106
Sex           1388106
Frmat         1388106
IM_Frmat      1388106
Deaths1       1388106
Deaths2       1387983
Deaths3       1387983
Deaths4       1328926
Deaths5       1328926
Deaths6       1328926
Deaths7       1387983
Deaths8       1387187
Deaths9       1387983
Deaths10      1387187
Deaths11      1387983
Deaths12      1387187
Deaths13      1387983
Deaths14      1387187
Deaths15      1387983
Deaths16      1387187
Deaths17      1387983
Deaths18      1387187
Deaths19      1387983
Deaths20      1387187
Deaths21      1387983
Deaths22      1384744
Deaths23      1384744
Deaths24      1185179
Deaths25      1185179
Deaths26      1387983
IM_Deaths1    1387983
IM_Deaths2     956982
IM_Deaths3     983359
IM_Deaths4     983359
dtype: int64